             PGM

             SNDMSG     MSG('This is a test message') TOUSR(CYA012) +
                          MSGTYPE(*INQ)

             ENDPGM
