      ** This is not finished.  Don't try to use it.
      **
      **  SSL will be added to the tutorial soon!
      **
      **
     D QSYRGAP         PR                  ExtPgm('QSYRGAP')
     D  app_id                      100A   const
     D  app_id_len                   10I 0 const
     D  app_controls                744A   options(*varsize)
     D  error_code                32766A   options(*varsize)
