     A* TESTFILE: PF to Demostrate Simple Trigger
     A          R TESTFILER
     A            F1             3A
     A            F2             5P 2
     A            F3              L
     A            F4              T
     A            F5              Z
     A            F6             3S 0
