     A* BOC ENCRYPTION KEY FILE
     A*
     A          R BOC_KEYFR
     A            KEY           16          TEXT('ENCRYPTION KEY')
     A                                      CCSID(65535)
     A*
