/* CRTCMD CMD(*CURLIB/GENQR) PGM(*LIBL/GENQRCODER) SRCFILE(*LIBL/QRPGSRC) SRCMBR(GENQR) */

CMD  PROMPT('Generate QR Code')

PARM KWD(TXT) TYPE(*CHAR) LEN(4296) PROMPT('Text') MIN(1)
PARM KWD(WIDTH) TYPE(*INT4) MIN(1) PROMPT('Width (i.e. 200)')
PARM KWD(HEIGHT) TYPE(*INT4) MIN(1) PROMPT('Height (i.e. 200)')
PARM KWD(FILE) TYPE(*CHAR) LEN(128) PROMPT('File (i.e. /home/file.png)') MIN(1)
